import type { Metadata } from 'next';
import { WEBSITE_URL } from '../constants';

const url = new URL('https://www.flysan.co.il');

export const defaultMetadata: Metadata = {
  title: {
    default: 'FlySan - תכנון טיולים ביפן',
    template: '%s | FlySan',
  },
  description:
    'FlySan היא סוכנות נסיעות המתמחה בטיולים ליפן 🇯🇵 המטרה שלנו – לעזור לכם לחוות את יפן לעומק, בצורה חכמה, נוחה ומרגשת. עם ידע מקומי, קשרים בשטח וניסיון של שנים בתכנון טיולים, אנחנו בונים עבורכם מסלולים אישיים ומדויקים – כולל לינה, תחבורה, אטרקציות, אוכל, וטיפים קטנים שהופכים את כל החוויה לבלתי נשכחת. בין אם זו הפעם הראשונה שלכם ביפן או שאתם חוזרים להתאהב בה מחדש – אנחנו כאן כדי לדאוג להכול. 🌸✨ FlySan – מתכננים חכם, מטיילים רגוע.',
  metadataBase: url,
  applicationName: 'FlySan',
  authors: { name: 'FlySan צוות', url },
  creator: 'FlySan צוות',
  keywords: [
    // 'חופשות במזרח',
    // 'טיולים באסיה',
    // 'דילים למזרח',
    'טיסות זולות',
    // 'חופשה במזרח',
    'FlySan',
    // 'טיול במזרח',
    // 'בתי מלון בתאילנד',
    'בתי מלון ביפן',
    // 'בתי מלון סרי לנקה',
    // 'חופשה בתאילנד',
    'חופשה ביפן',
    // 'חופשה בסרי לנקה',
    'טיולים ביפן',
    'תכנון מסלול יפן',
    'תכנון טיול יפן',
    'פליסאן',
    'פלי סאן',
  ],
  alternates: {
    canonical: new URL(WEBSITE_URL),
  },
  generator: 'Next.js',
  publisher: 'FlySan Team',
  manifest: '/site.json',
  icons: {
    apple: {
      url: '/apple-touch-icon.png',
      type: 'image/png',
    },
    icon: [
      {
        url: '/favicon-32x32.png',
        sizes: '32x32',
        type: 'image/png',
      },
      {
        url: '/favicon-16x16.png',
        sizes: '16x16',
        type: 'image/png',
      },
      {
        url: '/safari-pinned-tab.svg',
        rel: 'mask-icon',
      },
    ],
  },
  openGraph: {
    title: 'FlySan - החופשה הבאה שלך ביפן',
    description:
      'FlySan היא סוכנות נסיעות המתמחה בטיולים ליפן 🇯🇵 המטרה שלנו – לעזור לכם לחוות את יפן לעומק, בצורה חכמה, נוחה ומרגשת. עם ידע מקומי, קשרים בשטח וניסיון של שנים בתכנון טיולים, אנחנו בונים עבורכם מסלולים אישיים ומדויקים – כולל לינה, תחבורה, אטרקציות, אוכל, וטיפים קטנים שהופכים את כל החוויה לבלתי נשכחת. בין אם זו הפעם הראשונה שלכם ביפן או שאתם חוזרים להתאהב בה מחדש – אנחנו כאן כדי לדאוג להכול. 🌸✨ FlySan – מתכננים חכם, מטיילים רגוע.',
    url: WEBSITE_URL,
    siteName: 'FlySan',
    type: 'website',
    images: [
      {
        url: new URL('https://i.imgur.com/bRUKfyg.jpeg'),
        alt: 'Intro',
        type: 'image/jpg',
      },
    ],
  },
  twitter: {
    title: 'FlySan - החופשה הבאה שלך ביפן',
    site: '@flysan',
    description:
      'FlySan היא סוכנות נסיעות המתמחה בטיולים ליפן 🇯🇵 המטרה שלנו – לעזור לכם לחוות את יפן לעומק, בצורה חכמה, נוחה ומרגשת. עם ידע מקומי, קשרים בשטח וניסיון של שנים בתכנון טיולים, אנחנו בונים עבורכם מסלולים אישיים ומדויקים – כולל לינה, תחבורה, אטרקציות, אוכל, וטיפים קטנים שהופכים את כל החוויה לבלתי נשכחת. בין אם זו הפעם הראשונה שלכם ביפן או שאתם חוזרים להתאהב בה מחדש – אנחנו כאן כדי לדאוג להכול. 🌸✨ FlySan – מתכננים חכם, מטיילים רגוע.',
    card: 'summary_large_image',
  },
};
