{
  "thailand": {
    "title": "תאילנד",
    "cid": 4,
    "description": "תאילנד גן עדן טרופי במזרח אסיה - היא אחת המדינות הכי אהובות עלינו הישראלים , שילוב של חופשה מפנקת תרבות עתיקה ומטבח מעולה במחירים אטרקטיבים במיוחד. בדרום המדינה איים עם עצי קוקוס, חול לבן ומים כחולים , ובצפון ג'ונגלים ונופים עוצרי נשימה. מתאימה לכל סוגי המטיילים -זוגות שרוצים להתפנק , קבוצות ,משפחות עם ילדים ומטיילים אחרי צבא שרוצים טרקים ונופים , בתאילנד אפשר למצוא הכל . בקיצור עם תאילנד קשה לטעות 😎"
  },
  "sri-lanka": {
    "title": "סרי לנקה",
    "cid": 22,
    "description": "סרי לנקה, אי טרופי השוכן באוקיינוס ההודי, מציעה חוויה ייחודית של טבע עוצר נשימה, תרבות עשירה וחופים מדהימים. האי ידוע בתור יעד גלישה מפורסם ומתאים לכל הרמות - מהגולשים הכי מנוסים לאלה שגולשים בפעם הראשונה . סרי לנקה קצת מזכירה באנרגיות את הודו אבל הרבה יותר נקייה ומסודרת , אך עדיין מאוד אותנטית עם אנשים מדהימים . יש באי שתי עונות - עונה רטובה ועונה יבשה והן גם מתחלקות לפי אזורים . באיזור דרום מערב העונה היבשה היא דצמבר עד אפריל ובאיזור דרום מזרח העונה היבשה היא מאי עד ספטמבר.בין האטרקציות הבולטות תמצאו את מצודת סיגיריה המרשימה, מקדשי קנדי הקדושים, והעיר העתיקה אנורדאפורה. חובבי הטבע ייהנו מספארי בפארקים הלאומיים, בהם ניתן לצפות בפילים, נמרים וציפורים נדירות. סרי לנקה היא מדינה קסומה שכל אחד יכול למצוא בה משהו להתאהב בו 😊🐘🌴✨"
  },
  "japan": {
    "title": "יפן",
    "cid": 28,
    "description": "יפן המכונה גם ארץ השמש העולה היא מדינה קסומה של ניגודים בין מסורות ומבנים עתיקים לטכנולגיות החדשות ביותר בעולם. יפן מציעה חוויות ואטרקציות לכל סוגי המטיילים , החל מחופשות לזוגות וליחידים ,למשפחות עם ילדים או למטיילים אחרי צבא וקבוצות. אפשר להנות מקולנריה גבוהה ,מסעדות וחיי לילה שלא נגמרים בערים הגדולות ,אפשר להנות גם מטבע עוצר נשימה -הרים מושלגים וריוקנים מסורתיים. בתקופת האדו יפן סגרה את עצמה בפני העולם במשך כ- 200 שנה וכתוצאה מכך נוצרה בה תרבות יפנית ייחודית ושונה מתרבות המערב (ולכן גם כל כך קסומה), והדתות העיקריות בה הן שינטו ובודהיזם. בניגוד לדעה הרווחת בארץ- יפן ממש לא יקרה ותוכלו להנות בה ממלונות ובתי אירוח ברמות הכי גבוהות  וגם ממסעדות מישלן במחירים שבארץ אפשר רק לחלום עליהם 🙂 יפן מחכה לכם – בואו לחוות אותה! 🌸"
  }
}
