type JapanTravelPoint = {
  id: number;
  text: string;
};

export const japanPoints: JapanTravelPoint[] = [
  {
    id: 1,
    text: 'יפן היא מדינה גדולה ולעיתים קל לטבוע בכמות המידע שיש באינטרנט.',
  },
  {
    id: 2,
    text: 'יש הרבה מה לדעת על התרבות היפנית ששונה מאוד מהתרבות המערבית והישראלית בפרט.',
  },
  {
    id: 3,
    text: 'כדאי לדעת למה לצפות - יש מקומות שעומס התיירים משפיע על החוויה וכדאי להיות ערוכים.',
  },
  {
    id: 4,
    text: 'העונות ביפן: כל עונה והיתרונות שלה - כדאי לדעת באיזו עונה לתייר.',
  },
  {
    id: 5,
    text: 'הקידמה אל מול החוסר קידמה - מדינה מאוד מתקדמת אך יש בה גם צדדים מסורתיים ושמרניים שיכולים להפתיע מטיילים.',
  },
  {
    id: 6,
    text: 'התאמה אישית – כל אחד חווה את יפן אחרת. חובב קולינריה? רוצה לחוות את יפן המסורתית? מתכנן טיול משפחתי? אנחנו נתאים לך את המסלול המושלם.',
  },
];
