import React from 'react';
import { ContactUs } from '@/features/ContactUs';
// import { Countries } from '@/screens/Root/components/Countries';
import { AboutMe } from '@/components/AboutMe';
import YotamImg from '@/assets/images/yotamImg.jpeg';

const AboutUs = () => {
  return (
    <section className="flex flex-col gap-3 py-2 tb:py-4">
      <h1 className="text-center text-xl font-bold tb:text-2xl">עלינו🇯🇵</h1>
      <p className="mx-auto max-w-[700px] whitespace-pre-line text-center text-lg font-semibold leading-relaxed">
        {`FlySan היא סוכנות נסיעות המתמחה בטיולים ליפן 🇯🇵
המטרה שלנו – לעזור לכם לחוות את יפן לעומק, בצורה חכמה, נוחה ומרגשת.
עם ידע מקומי, קשרים בשטח וניסיון של שנים בתכנון טיולים, אנחנו בונים עבורכם מסלולים אישיים ומדויקים – כולל לינה, תחבורה, אטרקציות, אוכל, וטיפים קטנים שהופכים את כל החוויה לבלתי נשכחת.
בין אם זו הפעם הראשונה שלכם ביפן או שאתם חוזרים להתאהב בה מחדש – אנחנו כאן כדי לדאוג להכול.
🌸✨ FlySan – מתכננים חכם, מטיילים רגוע.`}
      </p>
      <AboutMe
        imgUrl={YotamImg.src}
        altName="יותם"
        title="מי אנחנו?"
        classNameImg="object-center"
        description={
          <>
            <p>
              FlySan הוקמה על ידי יותם בן דוד מתוך אהבה אמיתית ליפן ומתוך הרצון
              להפוך את תהליך תכנון הטיול לפשוט, מסודר ומהנה יותר.
            </p>

            <p>
              בשנים האחרונות ליווינו עשרות מטיילים ישראלים בתכנון טיולים ליפן –
              החל מזוגות ומשפחות ועד קבוצות חברים.
            </p>

            <p>
              ביחד עם יותם עובד נתנאל בן דוד, שחי ביפן כבר 7 שנים ומהווה חלק
              בלתי נפרד מ־FlySan. הניסיון המקומי וההיכרות היומיומית שלנו עם יפן
              מאפשרים לנו להעניק למטיילים מידע עדכני, המלצות מהשטח וזווית מקומית
              אמיתית.
            </p>

            <p>
              אנו בונים לכל לקוח מסלול אישי המותאם בדיוק לסגנון הטיול, לתקציב
              ולחלומות שלו, תוך דגש על ניצול נכון של הזמן, תחבורה נוחה, מלונות
              מתאימים ואטרקציות שבאמת שוות את הזמן והכסף.
            </p>

            <p>
              מעבר לבניית המסלול, אנו מלווים את המטיילים שלנו גם בהזמנת מלונות,
              אטרקציות, סיורים והעברות – כדי לאפשר חוויית תכנון נוחה ומסודרת
              במקום אחד.
            </p>

            <p>
              המטרה שלנו היא לא רק לבנות לכם מסלול, אלא לתת לכם שקט נפשי וביטחון
              לאורך כל הדרך – מהרגע הראשון ועד החזרה לארץ.
            </p>
          </>
        }
      />
      {/* <Countries /> */}
      <ContactUs />
    </section>
  );
};

export default AboutUs;
